# Binaries
brew "fish"
brew "git"
brew "jq"
brew "bat"
brew "tree"
brew "ripgrep"
brew "python@3.8"
brew "httpie"
brew "wget"
brew "docker"
brew "gradle"
brew "imagemagick"
brew "coreutils"
brew "cowsay"
brew "lolcat"
brew "mas"
brew "stow"

# https://github.com/corretto/corretto-8/issues/42
tap "homebrew/cask-versions"
cask "corretto8"
cask "corretto"

# Fonts
tap "homebrew/cask-fonts"
cask  "font-jetbrainsmono-nerd-font", args: { fontdir: "/Library/Fonts" }

# macOS apps
cask_args appdir: "/Applications"
cask "1password"
cask "alfred"
cask "amazon-chime"
cask "amazon-music"
cask "amazon-photos"
cask "authy"
cask "docker"
cask "firefox"
cask "flux" # Settings: Halogen, Tungsten, Candle
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
#cask "microsoft-excel"
cask "microsoft-edge"
#cask "microsoft-powerpoint"
#cask "microsoft-outlook"
#cask "microsoft-word"
cask "opera"
cask "quip"
cask "rocket" # Settings: % as trigger
cask "setapp"
cask "sketch"
cask "visual-studio-code"
cask "xpra"

# macOS App Store
mas "Clocker", id: 1056643111
mas "Magnet", id: 441258766
